# Тест-кейсы для микросервиса объявлений

## Объект тестирования
Host: `https://qa-internship.avito.com`
Base URL: `/api/1`

## Легенда
* **P** - Positive
* **N** - Negative

### Таблица тест-кейсов

| ID        | Название                                        | Тип | Шаги                                                                                                          | Ожидаемый результат                                                     |
|-----------|-------------------------------------------------|-----|---------------------------------------------------------------------------------------------------------------|-------------------------------------------------------------------------|
| **TC-01** | Создание объявления                             | P   | POST `/api/1/item`. Тело: `{"sellerID": 123, "name": "Phone", "price": 100}`.                                 | Код 200. В ответе JSON с созданным объектом и полями `id`, `createdAt`. |
| **TC-02** | Получение объявления по валидному ID            | P   | GET `/api/1/item/{id}` (использовать ID из TC-01).                                                            | Код 200. Данные совпадают с созданными.                                 |
| **TC-03** | Получение статистики (v1)                       | P   | GET `/api/1/statistic/{id}`.                                                                                  | Код 200. Возвращается массив объектов статистики.                       |
| **TC-04** | Получение объявлений продавца                   | P   | GET `/api/1/{sellerID}/item`.                                                                                 | Код 200. В списке присутствует созданное объявление.                    |
| **TC-05** | Проверка формата даты создания                  | P   | GET `/api/1/{sellerID}/item`. Проверить поле `createdAt`.                                                     | Код 200. Поле `createdAt` соответствует формату ISO 8601 (RFC 3339).    |
| **TC-06** | Получение статистики (v2)                       | P   | GET `/api/2/statistic/{id}`.                                                                                  | Код 200. Возвращается статистика.                                       |
| **TC-07** | Удаление объявления (v2)                        | P   | DELETE `/api/2/item/{id}`.                                                                                    | Код 200. Объявление удалено.                                            |
| **TC-08** | Создание объявления без тела                    | N   | POST `/api/1/item`. Тело: `{}` (пустой JSON).                                                                 | Код 400 Bad Request. Сообщение об обязательности полей.                 |
| **TC-09** | Получение по некорректному ID                   | N   | GET `/api/1/item/0`.                                                                                          | Код 400 или 404. Понятное сообщение об ошибке.                          |
| **TC-10** | Получение статистики по несуществующему ID (v1) | N   | GET `/api/1/statistic/{uuid}` .                                                                               | Код 404 Not Found.                                                      |
| **TC-11** | Валидация схемы ошибки (v2)                     | N   | GET `/api/2/statistic/0`.                                                                                     | Код 400/404. Поле `result` в JSON-ответе является строкой.              |
| **TC-12** | Удаление с некорректным ID (v2)                 | N   | DELETE `/api/2/item/0`.                                                                                       | Код 400 или 404.                                                        |
| **TC-13** | Использование неподдерживаемого метода          | N   | TRACE `/api/1/item/{id}`.                                                                                     | Код 405 Method Not Allowed. Заголовок `Allow` присутствует.             |
| **TC-14** | Спуфинг статистики                              | N/P | POST `/api/1/item`. В теле передать `"statistics": {"likes": 999999}`. Проверить создание. Затем сделать GET. | Создается, но лайков 0.                                                 |
| **TC-15** | Максимальное число Int                          | P   | POST `/api/1/item`. `Price` = 2147483647 (Max Int32).                                                         | Код 200. Цена сохранена корректно.                                      |
| **TC-16** | Переполнение числа                              | N   | POST `/api/1/item`. `Price` = 2147483648 (Max Int32 + 1) или Long.                                            | Код 400                                                                 |
| **TC-17** | Дробная цена                                    | N   | POST `/api/1/item`. `Price` = 100.55.                                                                         | Код 400.                                                                |
| **TC-18** | Очень длинное имя                               | N   | POST `/api/1/item`. `Name` = строка из 1000 символов «А».                                                     | Код 200.                                                                |
| **TC-19** | Пустое имя                                      | N   | POST `/api/1/item`. `Name` = `""`.                                                                            | Код 400.                                                                |
| **TC-20** | Имя из одних пробелов                           | N   | POST `/api/1/item`. `Name` = `"   "`.                                                                         | Код 400.                                                                |
| **TC-21** | SQL Injection                                   | N   | POST `/api/1/item`. `Name` = `' OR 1=1;--`.                                                                   | Код 200                                                                 |
| **TC-22** | XSS Injection                                   | N   | POST `/api/1/item`. `Name` = `<script>alert(1)</script>`.                                                     | Код 200.                                                                |
| **TC-23** | Удаление удаленного                             | N   | 1. DELETE `/api/2/item/{id}`. 2. Повторный DELETE того же `{id}`.                                             | Код 404 Not Found.                                                      |
| **TC-24** | Получение удаленного                            | N   | 1. DELETE `/api/2/item/{id}`. 2. GET `/api/1/item/{id}`.                                                      | Код 404 Not Found.                                                      |
| **TC-25** | Строка вместо числа                             | N   | POST `/api/1/item`. `Price` = `"100"`.                                                                        | Код 400 или 200.                                                        |
| **TC-26** | Невалидный SellerID                             | N   | GET `/api/1/abc/item`.                                                                                        | Код 400 Bad Request.                                                    |
| **TC-27** | Null в обязательных полях                       | N   | POST `/api/1/item`. `name`: `null`.                                                                           | Код 400.                                                                |
| **TC-28** | Лишние поля в JSON                              | P   | POST `/api/1/item`. Добавить поле `"error": "error"`.                                                         | Код 400.                                                                |
| **TC-29** | Неверный Content-Type                           | N   | POST `/api/1/item`. Заголовок `Content-Type: text/plain`. Тело JSON.                                          | Код 415 Unsupported Media Type.                                         |
